iPig/src/InformationRegisters/Супоросность/Супоросность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Супоросность</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РезультатУЗИ</name>
    <type>
      <types>EnumRef.РезультатУЗИ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоследнееСобытие</name>
  <attributes>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоследнегоСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоследнееСобытие</name>
    <type>
      <types>EnumRef.ПоследнееСобытие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/РезультатУЗИ/РезультатУЗИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатУЗИ</name>
  <enumValues>
    <name>Негативный</name>
  </enumValues>
  <enumValues>
    <name>Неизвестный</name>
  </enumValues>
  <enumValues>
    <name>Позитивный</name>
  </enumValues>
</mdclass:Enum>

iPig/src/Enums/ПоследнееСобытие/ПоследнееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоследнееСобытие</name>
  <enumValues>
    <name>Случка</name>
  </enumValues>
  <enumValues>
    <name>УЗИ</name>
  </enumValues>
  <enumValues>
    <name>Опорос</name>
  </enumValues>
  <enumValues>
    <name>Отъем</name>
  </enumValues>
  <enumValues>
    <name>Ввод</name>
  </enumValues>
  <enumValues>
    <name>Выбытие</name>
  </enumValues>
  <enumValues>
    <name>Аборт</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/Супоросность/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись ИЗ ЭтотОбъект Цикл    
		Если Запись.РезультатУЗИ = Перечисления.РезультатУЗИ.Негативный Тогда
			НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДатаВвода.Установить(Запись.ДатаВвода);
			НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0  Тогда
				ЗаписьСтатус = РегистрыСведений.ПоследнееСобытие.СоздатьМенеджерЗаписи();
				ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
				ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
				ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
				ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ; 
				ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
				ЗаписьСтатус.Записать(Истина);
			Иначе                             
				Для Каждого ЗаписьСтатус ИЗ НаборЗаписей Цикл
					Если (Запись.НомерОпороса >= ЗаписьСтатус.НомерОпороса)  И (Запись.Период > ЗаписьСтатус.ДатаПоследнегоСобытия) Тогда
						ЗаписьСтатус.ДатаВвода 		= Запись.ДатаВвода;
						ЗаписьСтатус.НомерЖивотного = Запись.НомерЖивотного;
						ЗаписьСтатус.ДатаПоследнегоСобытия =  Запись.Период;  
						ЗаписьСтатус.ПоследнееСобытие = Перечисления.ПоследнееСобытие.УЗИ;
						ЗаписьСтатус.НомерОпороса     = Запись.НомерОпороса;
					КонецЕсли;	
				КонецЦикла; 
				НаборЗаписей.Записать(Истина);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
